[{"title":"WHY NLP?","content":"<p>The Prophet said: \"GOD created the brain and said,\" By My glory and my sublimity, I did not create anything else for which I have more respect than you. I give by you, I take by you, I reward and I punished by you\".\"</p><p>“Ward off passing thoughts, for if you do not, they will become ideas. Ward off ideas, for if you do not, they will become desires. Fight them, for if you do not, they will become resolve and determination, and if you do not ward them off, they will become actions. If you do not resist them with their opposite, they will become habits and it will be difficult for you to get rid of them.” (Al Fawaid by Ibn al-Qayyim)</p><p>What could be easier to justify a failure than to blame others? Spouse, boss, employees, customers, children ... the list is long. Some point their finger and say \"if I have not succeeded, it is because of my family.\" Others blame their husband or wife. Others blame the color of their skin, the religious prejudices, and the lack of education or their physical disabilities. Some say they are too old or too young, too fat or too thin, or pretend to live in the wrong place. This is the fault of the government, the weather, family, whatever we come up with excuses such as \"I am not a born salesman, doctor or engineer” and so and so forth. Till now, I've never met a single woman who has given birth to a lawyer, a doctor, an engineer or a businessman! A woman gives birth to a girl or a boy. My dear brothers and sisters, all these excuses are just lies, invented to deny the truth. They are only pretexts used to avoid admitting our responsibility. I want you to be aware that when you point the finger at someone else, you also point three fingers towards you. Instead of complaining that you run out of money or time, you should rather ask ` ` How ` ` instead of ` ` Why ` `; To get the money or the time you need take the habit to ask yourself how can get the time I need or the money. When you are asking ` ` how ` ` you are forcing your mind to look for ways to find the answers, but you are asking ` ` why ` ` you are looking for causes.</p><p>As you continue to behave like you've always done, you'll not get any better results than what you've always had. Many of us remain chained to their habits, always doing and thinking within the same. If you're an alcoholic and you still drink, you'll continuously struggle with an equivalent family and health problems. If you're violent naturally and you systematically face events by violence, things will never change. Your life won't improve as long as you still behave in the same manner. The definition of insanity is doing the same thing over and over and expecting different results quoted by Einstein The situation you live in today is the sum of all the choices, good or bad, that you have made in your life. That is why you must agree to take responsibility for your own life. There’s no alternative, it's the acceptance of your responsibility and your ability to reply and choose your answers will determine your future success.</p><p>NLP is tool of getting hold of your mind, your negative thoughts, knowing your thinking patterns, being aware of your unconscious strategy beneath your behavior, recognition of cognitive distortions that lead spoil your relationships, your work environment etc. John Grinder (Co-developer of NLP) once said that he had identified 3 main obstacles to mastery of any skill:</p><ul><li><a href=\"https://counselncare.com/npl.php#\">Over reliance on focal vision</a></li><li><a href=\"https://counselncare.com/npl.php#\">Internal negative dialogue</a></li><li><a href=\"https://counselncare.com/npl.php#\">Feeling of hesitation</a></li></ul><p>This seems to be particularly true when it comes to learning NLP, which relies on your ability to perceive thing much wider and act more prudently. By finding ways to overcome these obstacles you can increase your abilities and optimally utilize the intellectual power which differentiates you from rest of the creation of the universe.</p>","id":"id163723572067633514","date":"2024-02-12T05:01:38.424Z"},{"title":"NLP INTRODUCTION","content":"<p>Neuro -The Nervous System, through which our experience is processed via five senses:</p><ul><li><a href=\"https://counselncare.com/npl-introduction.php#\">Visual</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Auditory</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Kinesthetic</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Olfactory</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Gustatory</a></li></ul><p>Linguistics - Language and other non-verbal communication systems through our neural representations are coded, ordered, and given meaning:</p><ul><li><a href=\"https://counselncare.com/npl-introduction.php#\">Pictures</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Sounds</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Feelings</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Tastes</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Smells</a></li><li><a href=\"https://counselncare.com/npl-introduction.php#\">Internal dialogue (self-talk)</a></li></ul><p>Programming -The ability to discover and utilize programs we run (the communication to ourselves and others) in our neurological systems to achieve our desired outcomes</p><p>NLP is a methodology based on the overall operational presupposition that all behavior has a structure,&nbsp;and that structure can be modeled, learned, taught, and changed (re-programmed). The way to know what will be useful and effective are acute perceptual skills. NLP has evolved as an innovative technology enabling the practitioner to organize information and perceptions in ways that allow them to achieve results that were once inconceivable.\" -&nbsp;Richard Bandler</p>","id":"id143560110145127404","date":"2024-02-12T05:10:03.505Z"},{"title":"NLP-PRESUPPOSITIONS","content":"<ul><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">Respect the other person’s view of the world</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">Communication is the response we receive, not our intention given</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">The map is not the territory</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">There are no resistant clients, only inflexible communicators; resistance indicates a lack of Rapport</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">There is no failure, only feedback</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">People have all the resources they require to succeed; there are no unresourceful people only unresourceful states</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">All behavior has a positive intention given the resources available</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">System/person with the most flexibility of behavior will control the system - Law of Requisite Variety</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">Behavior / change are to be evaluated in terms of context &amp; ecology</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">You are in charge of your mind therefore your results</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">The mind and body are linked neurologically, therefore affect each other</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">Whatever you think you are, you are that and more. Calibrate on behavior, you are not your behavior. Accept the person, change the behavior</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">All procedures should be designed to increase choice</a></li><li><a href=\"https://counselncare.com/npl-presuppositions.php#\">All presuppositions are a choice in perception; including this one</a></li></ul>","id":"id36434133335070531","date":"2024-02-12T05:36:10.751Z"},{"title":"NLP-SENSORY ACUITY","content":"<p>Basis: In the mid-70's, the creators of NLP observed that people make minute changes from moment to moment in their physiology and that those changes have meaning if you have enough sensory acuity skills to interpret these subtle minute adjustments. Below are five physical changes to become more acutely aware of and notice on someone else's body. Sensory Acuity is the basis of all our interactions. It all begins with in noticing what others are reacting to and then how to respond appropriately in return. This is inherently an essential part of our communication loop as human beings and plays a vital role in how we decide what words and behaviors to choose when we do reply even at an unconscious level.</p><p>Skin Color<br>Light &lt;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -&gt; Dark<br><br>Skin Tonus<br>Shiny &lt;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -&gt; Not Shiny<br><br>Breathing Rate<br>Fast &lt;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -&gt; Slow<br><br>Breathing Location<br>High &lt;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -&gt; Low<br><br>Lower Lip Size<br>Lines (pursed) &lt;- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -&gt; No Lines (relaxed)<br><br>Eyes Focused<br>Focused &lt;- - - - - - - - - - - - - - - - - - -- - - - - - - - - - - - - - - -&gt; Defocused</p>","id":"id57302212105750672","date":"2024-02-12T05:39:02.682Z"},{"title":"NLP-RAPPORT","content":"<p>This Model of Communication&nbsp;originated from Dr. Ray L.Birdwhistle, an anthropologist, from his book \"Kinesics in Context\" published from the University of Pennsylvania press in 1970. Rapport then can be modeled and duplicated. It is a process of responsiveness, not necessarily a ‘liking’. Birdwhistle concluded that 93% of our communication transpires non-verbally and unconscious. NLP rapport skills techniques teach us how to communicate at that unconscious level. Thus producing a ‘liking.’</p><p>Theory:&nbsp;Communication is -&nbsp;<br>55% Physiology<br>38% Tonality<br>7% Words</p><p>Process:&nbsp;Rapport is established by mirroring and matching and is one of the most important features or characteristics of unconscious human interaction. It is this commonality of perspective, being in \"sync\", being on the same wavelength as the person you are talking to which creates this ‘feeling’ of liking.</p><p>Physiology&nbsp;- 55%<br>• Posture&nbsp;&nbsp;<br>• Breathing&nbsp;&nbsp;<br>• Gestures<br>• Facial expression &amp; Blinking</p><p><strong>Tonality </strong>– 38%<br>• Volume = loudness • Tone = pitch<br>• Tempo = speed<br>• Timbre = quality</p><p><strong>Words</strong>—7%<br>• Predicates<br>• Key words<br>• Content chucks<br>• Common experiences</p>","id":"id5024566457071373","date":"2024-02-12T05:41:48.287Z"},{"title":"NLP-STRATEGY","content":"<p>STRATEGY = MODALITIES + SEQUENCE<br>The Strategy is a specific sequence&nbsp;of external and internal experience which results a specific outcome. It is described as specific pattern of thoughts and behaviors which produce results. In NLP Strategies means Program underneath the producing results. Effective individuals develop consistent step-by-step procedures for solving problems, making decisions etc. These specific sequences of mental steps are called “strategies” in NLP.</p><p>In NLP the strategy is how we use our neurological processes (seeing, hearing, feeling, smelling and tasting), to utilize with our language, and how the two are combined to produce a particular program or strategy. In NLP model it is the way we organize our sensory and linguistic functions into a programmable sequence of mental activity that determines how we will perceive and respond to the world around us.”</p><p>Everything we do involves strategies. All our daily activity is generated and maintained by strategies. Whatever we do and way we behave is governed by a strategy</p><p>Examples of strategies:<br>Love, Decision, Relaxation, Hate, Motivation, Tension, Learning, Stress, Depression, Happiness, etc.</p>","id":"id54043074177000351","date":"2024-02-12T05:42:29.423Z"},{"title":"NLP-REPRESENTATIONAL SYSTEMS","content":"<p>Every individual has a preferred representational system (Visual, Auditory or Kinesthetic) through which they represent the world to them Understanding our preferred representational system allows us to set better, more compelling goals for ourselves, and work in ways that improve our performance. On the other hand Understanding what another person’s preferred representational system gives us a better idea as to how we can communicate with them most effectively.</p><p>VISUAL: The individual operating from a visual representational system will primarily connect with the world through their eyes, they use their vision for memory and decision making For such individual Visual processing takes in lots of information, and a picture can carry more information than Sound or feeling. Individuals with this representational system preference are often very Skilled in being able to see the big picture and plan on a long-term basis. You’ll notice that they pay particular attention to how they look, how their home looks and how others look.</p><p>AUDITORY: People who mainly operate from an auditory representational system will typically be more aware of a subtle change in the tone of your voice and be more responsive to certain tones of voice. They can be easily distracted by noise. They best learn by listening and asking questions. They enjoy taking part in discussions and prefer to communicate through spoken language as supposed to writing. They need to be more heard of. They are more sequential in their thinking and can remember instructions and directions more easily.</p><p>KINESTHETIC: People with kinesthetic preference operate predominantly in feelings and therefore have a high sense of body awareness. They are more aware of their bodies and feelings and respond more to physical rewards and touch. They tend to speak slower because they gather time to get in touch with their feeling about the topic. They learn by movements, doing or touching. They often make decisions based on their feeling.</p>","id":"id71655042003404156","date":"2024-02-12T05:42:59.509Z"},{"title":"NLP-ANCHORING","content":"<p>Identify times, situations, circumstances, and people that have triggered some sort of emotional response in you. Consider personality traits that you dislike in others, automatic reactions you have to others/events, and fears and insecurities that you have.</p><p>Anchoring is simply classical conditioning. It is the association of a stimulus with a response. The object is to get into the state of mind, into the state of consciousness, then set up a trigger (i.e. Anchor) An Anchor can be a touch, a word, a smell, a sound, or a taste. Once we have accessed the appropriate internal representation, we can establish an anchor that will be our external link to that state of consciousness.</p><p>Our neurology creates anchors&nbsp;that allow us to respond to situations quickly and efficiently. The drawback is that, although these anchors worked well when they were created, they may not be appropriate at this time. Fortunately, we can change, or reprogram, these anchors to get a desired result from a specific stimulus. This is done with care for the individual's personal ecology, ensuring that the proposed change will not actually cause harm or discomfort to the person. Once changed, the anchor remains changed until action is taken to change it again</p><p>Understanding our anchors is the first step we can take towards taking full control over our lives, where we can start living life from a place of strength as opposed to being governed and managed by our emotions.</p>","id":"id503760020356415614","date":"2024-02-12T05:43:30.069Z"},{"title":"NLP-REFRAMING","content":"<p>When we are highly emotionally aroused (overly anxious, angry, frightened, depressed, etc), our thinking becomes the all-or-nothing, black-or-white variety. A chosen metaphor containing a reframe can put us out of this ‘state’ and help us to see things from different perspective for example, that our situation won’t last forever, that it might easily be due to other causes than what we had supposed, and that we do have other options.</p><p>Reframing method is used to change the perception&nbsp;of an individual with a negative interpretation of an experience. We place a prescribed meaning to every event we experience. The meaning we place upon these experiences allows us to perform or behave within a particular context. A reframe can quickly interrupt a person’s thought process which then may cause the person to experience new internal representation replacing the negative one.</p><p><strong>Content Reframing</strong><br>For example, if someone says I am exhaust and I can’t go on living like this, you can reframe and respond “Yes of course you can`t go on living the way you have been living until now, there’s a need to make changes.<br>For example, if someone says I hate when it rains, you can respond yes I know it can be pain but if there is no rain the planed would die and no crops would grow and we will run of water.</p><p><strong>Context Reframing</strong><br>For example, if someone says I am too impatient you can respond by saying that means you are quick thinker in emergency. In context reframing the behavior should be kept constant and context is changed.</p>","id":"id60432403355322273","date":"2024-02-12T05:44:22.818Z"},{"title":"NLP-MODELLING","content":"<p>It worth to mentioned that NLP uses the word \"model\" in different ways. The understanding of the “Model” by scientists and engineers mean that they understand how something works. An image of a molecule is part of the model. A&nbsp; Mathematical description of the forces that hold it together and cause it to interact&nbsp;with other things is part of the model. In NLP, the systematic understanding of&nbsp;how someone creates excellence is a model.&nbsp;At the same time, the excellent person is a model, in a sense very similar to the&nbsp;term \"role model.\" So you could say that we model the model. We create a model of a&nbsp; person who serves as a model of excellence. Then we attempt to produce excellence&nbsp;by applying our understanding (our model of the person). This article will focus on&nbsp;the use of the word \"model\" as a detailed understanding of how someone produces&nbsp; excellent results.&nbsp;A wonderful thing about such a model is that it helps us teach others how to&nbsp;achieve excellence. It is much easier to teach someone a systematic understanding&nbsp;than to just say, \"Here, do what I'm doing.\" Since models can be complicated, NLP&nbsp;trainers usually teach them in pieces. Then, as each piece is mastered, it comes&nbsp;together as unconscious mastery. This is a good way to teach most complicated&nbsp;skills. The more pieces you master, the more intuitive you become--the better you&nbsp;can improvise and come up with solutions.</p><p>Below are the basic steps which help to model someone:<br><br><strong>Eliciting strategies:</strong>&nbsp;<br>Here you consider various aspects of the person's thinking and behavior. You are&nbsp;deconstructing their success into discrete pieces of information. Your ability to do&nbsp;this is called \"acuity<br><br><strong>Mapping:</strong>&nbsp;<br>Here, you make the model systematic; you map out the model into a syntax of&nbsp;thoughts and behaviors, including very subtle nuances and unconscious aspects.&nbsp;<br><br><strong>Reproducing:&nbsp;</strong><br>Now you have a more systematic model. It is ready for you to apply. Depending&nbsp;on your results, you may need to refine your model through further observation&nbsp;and analysis. You may need numerous experiments (trial and error) before you can&nbsp; reliably produce similar results.&nbsp;<br><br><strong>Observation:</strong><br>Modeling in NLP is about recognizing what works. Thus, the models you create&nbsp;from successful people are not exactly intellectual property. You are basically&nbsp;pointing out what is already happening This means that the model does not belong to NLP. You&nbsp;could say that NLP was the methodology or vehicle for finding a way to imitate&nbsp;successful behavior and to further innovate.</p>","id":"id715560235113704634","date":"2024-02-12T05:44:51.086Z"},{"title":"NLP-META-PROGRAM","content":"<p>Meta-programs are the rules that tell our minds what parts of our experiences are used to form our thoughts and decisions. You can see the influence of cybernetics, which was a big factor in the development of NLP. A thermostat has rules that control its \"decisions\" to turn the heat or air conditioning on and off. You could say that these are its meta-programs. Of course, people are much more complicated. In NLP, we describe the strategies that people use or create so that they can achieve something. These are not just behavioral rules. They are the rules that result in our decisions. An example of a meta-program is the \"toward versus away from\" preference. Some people tend to think in terms of moving toward what they want. They may experience the motivation to do their taxes as a desire for a sense of mastery or completion. They may be driven by the desire to maximize deductions while being audit-proof. They may be driven to experience the relief they feel when they drop the envelope in the mail. The \"away from\" person has very different drives for completing their taxes. These people focus on avoiding trouble with the government, and getting the whole thing over with so they don't have to suffer through it any longer than necessary. They are \"getting away from\" what they fear or dislike, instead of \"going toward\" what they desire. They focus more on avoiding negative consequences than on getting positive ones. If you want to motivate someone, you need to know if they use a toward or away from meta-program. The more meta-programs you learn to observe, the more ways you have to motivate, negotiate, and help someone succeed. This means that when you model someone, you have a richer model when you know as much as possible about their meta- programs.</p>","id":"id74777577534263723","date":"2024-02-12T05:45:34.102Z"},{"title":"NLP TECHNIQUE-How To Break Automatic Negative Thought And Behavior Pattern","content":"<p>Step 1- Close your eyes, think and recognize the automatic response (images, thoughts, and feelings) that occurs when you think of some challenging situation.<br>Select a replacement image (something inspiring) that helps in creating a positive state, enhance the quality by making the image bigger, darker and close to your mental screen, do this until it becomes as compelling as possible.<br><br>Step 2- Now think of what comes to your mind just before the negative thought or behavior which makes to begin your negative state, look with your eyes what occurs just before you engage in negative activity or behavior. Go in details of the scene.<br><br>Step 3- Put the replacement image in the corner of the negative image, imagine a small ball sized version of your replacement scene in the bottom corner of the negative scene.<br><br>Step 4-Swiss the two images simultaneously with increasing speed. Have the negative scene become smaller and at same time have the replacement image closer and larger, rapidly and completely replacing the negative scene.<br><br>Step 5-Repeat the process and do it faster and faster until you it happens very quickly.<br><br>Step 6- Now try to use the limiting thought and behavior again to notice the result if your relapse use the swish pattern again and again until your negative pattern goes away.</p>","id":"id207304165322232004","date":"2024-02-12T05:46:00.054Z"},{"title":"NLP TECHNIQUE-How To Cure Phobia","content":"<p>Step 1- Select the situation in which they react with excessive fear or anxiety and make the person go to the third perceptual position (i.e. sitting in the projector room) and second image of him sitting comfortably in a theatre to watch a video of them<br><br>Step 2- Run the movie once normally and then backwards, have the person watch the situation play out from this disassociated position (i.e. sitting in the projector room seeing another duplicate of him in theatre watching his third duplicate in the screen)<br><br>Step 3- Now asks the person to change the movie from color to black and white. This time when it ends, have them freeze the disturbing image and fade it to black.<br><br>Step 4-Now have the person move into the first position seeing the movie with their own eyes, have the person experience the movie first hand and in full color but backwards.<br><br>Step 5- Repeat these movies steps until the person has no longer fearful reaction. To summarize the steps, get them back in the movie theater, run the movie backwards, switch to black and white, and run the movie forwards, finally switch to first position with full color and run the movie backwards to its starting point where it freeze frames and fades to black.</p>","id":"id60607420715011635","date":"2024-02-12T05:46:36.077Z"},{"title":"NLP-TECHNIQUE-HOW TO BECOME A MASTER COMMUNICATOR","content":"<p>Step -1. Find someone who will allow you to practice this exercise with them. Ask them&nbsp;to think about a pleasant memory. Encourage them to do this with eyes closed, and&nbsp;in the first perceptual position, as though they are experiencing it first hand.&nbsp;<br><br>Step -2. Once your partner has a pleasant memory in mind, have your subject focus&nbsp;exclusively on the visual aspect of the memory. Note all of your subject's reactions,&nbsp;including changes in posture, facial expression, changes in skin color, pattern of&nbsp;breathing etc<br><br>Step -3. Have your partner clear their mind and open their eyes. Have them bring up only&nbsp;the auditory aspect of the memory.&nbsp;Continue making your observations.&nbsp;<br><br>Step -4. Have your partner focus on the kinesthetic.&nbsp;Once they have done this, have them bring up the kinesthetic aspect as you&nbsp;continue to observe.&nbsp;<br><br>Now divide your observations into&nbsp;<br>• Visual Reactions,<br>• Auditory Reactions,<br>• Kinesthetic Reactions.<br><br>Once you have done this exercise, you can improve your powers of observations&nbsp;by being aware of subtle physiological signals, and how they are&nbsp;influenced by factors such as primary sense mode, emotional arousal, rapport, and&nbsp;anything else of importance.</p>","id":"id76374744745075655","date":"2024-02-12T05:47:06.482Z"},{"title":"NLP TECHNIQUE-How To Resolve Internal Conflicts","content":"<p>Step -1. Select a personal conflict where you are struggling with mixed contradictory feelings whether to do this or do that<br><br>Step -2. Recall a memory of experiencing this inner conflict. View it from the observer position.<br><br>Step -3. Get into the first perceptual position in imagination with one side of the conflict. Step into the experience. Review the opposite side of the conflict from this position.<br><br>Step -4. Still being that side, ask the opposite side to precise all of its positive intentions including any beliefs and goals that it can express to your side.<br><br>Step -5.Now switch into the other part. From this position, repeat steps three and four.<br><br>STEP-6. Repeat this switching and receiving until each side has an honest understanding of each other<br><br>Step -7. Move to a meta-position above both parts (i.e. third Perceptual position) From there, ask the parts to propose solutions or outcomes that they expect to be satisfactory to both sides. Do as much brain-storming as you need to in order to come up with a good collection of ideas.<br><br>Step -8. Now Notice how this new collection of ideas is an amalgam of the values and intentions of both the parts. It is also an agenda. Bring this part into your body and accept it as an important part.<br><br>Step -9. Imagine a future with this part creating results for you.</p>","id":"id377763024241212754","date":"2024-02-12T05:47:37.799Z"}]